<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.3  (Linux)">
	<META NAME="AUTHOR" CONTENT="Liviu Lalescu">
	<META NAME="CREATED" CONTENT="20050616;21010400">
	<META NAME="CHANGEDBY" CONTENT="Liviu Lalescu">
	<META NAME="CHANGED" CONTENT="20050616;21031800">
</HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1>FAQ - Foire aux Question</H1>
<P STYLE="margin-bottom: 0in">dimanche 27 f&eacute;vrier 2005. 
</P>
<P>&nbsp;</P>
<H2><A HREF="mailto:fetfr@free.fr">J&eacute;r&ocirc;me DURAND</A></H2>
<P><BR><BR>
</P>
<P>Cette FAQ est en cours de traduction. L&rsquo;original (en
anglais) est disponible dans le r&eacute;pertoire doc des sources de
FET. 
</P>
<P>Q&nbsp;: Quelle est la structure des donn&eacute;es en entr&eacute;e
de FET&nbsp;? 
</P>
<P>R&nbsp;: Etudiants - organis&eacute;s en ensembles (des
promotions, contenant des groupes, contenant des sous-groupes) 
</P>
<P>Enseignants 
</P>
<P>Mati&egrave;res ( nom des enseignements dispens&eacute;s, par
exemple Maths, physique, etc...) 
</P>
<P>Activit&eacute;s&nbsp;: l&rsquo;association d&rsquo;un ou
plusieurs enseignants, d&rsquo;une mati&egrave;re et d&rsquo;un ou
plusieurs ensembles d&rsquo;&eacute;tudiants. Ceci correspond aux
cours, travaux dirig&eacute;s, travaux pratiques ... 
</P>
<P>Contraintes&nbsp;: elles peuvent &ecirc;tre de deux types soit
temporelles (li&eacute;es au jour ou &agrave; l&rsquo;heure devant
&ecirc;tre allou&eacute;s), soit de salles (li&eacute;es &agrave;
l&rsquo;allocation de salles particuli&egrave;res). Elles peuvent
&eacute;galement &ecirc;tre obligatoires ou non. 
</P>
<P>ConstraintBasicCompulsoryTime et ConstraintBasicCompulsorySpace
sont deux contraintes implicites pour tous les emplois du temps.
Elles sont ajout&eacute;es automatiquement. Autre contrainte ajout&eacute;e
automatiquement, ConstraintActivityPreferredTime, quand une nouvelle
activit&eacute; est ins&eacute;r&eacute;e. 
</P>
<P>Chaque contrainte a un poids, les contraintes implicites ont la
valeur par d&eacute;faut de 1.0. Vous pouvez modifier le poids des
autres contraintes, et vous &ecirc;tes encourag&eacute;s &agrave;
jouer sur ces valeurs. Comment calculer le facteur de conflit d&rsquo;une
contrainte&nbsp;? Simplement, c&rsquo;est le nombre de conflits,
multipli&eacute; par 1 pour les activit&eacute;s bihebdomadaires et
par 2 pour les activit&eacute;s hebdomadaires, le tout multipli&eacute;
par le poids de la contrainte. 
</P>
<P>PS&nbsp;: il est conseill&eacute; de travailler avec des poids
entiers pour l&rsquo;instant (entre 1 et 100). 
</P>
<P>Nouveau&nbsp;: les donn&eacute;es de FET peuvent aussi contenir
une liste d&rsquo;&eacute;quipements. 
</P>
<P>Q&nbsp;: Comment fonctionne FET&nbsp;? 
</P>
<P>R&nbsp;: Un algorithme g&eacute;n&eacute;tique simple. Vous pouvez
lire mes articles ( sur mon site web http://lalescu.ro/liviu/fet ) &agrave;
ce sujet. 
</P>
<P>Pour l&rsquo;essentiel (allocation des heures)&nbsp;: chaque
emploi du temps possible est repr&eacute;sent&eacute; par un tableau,
disons times[i], o&ugrave; i varie de 0 au nombre d&rsquo;activit&eacute;s
moins un. L&rsquo;emplacement times[i] contient l&rsquo;heure allou&eacute;e
pour l&rsquo;activit&eacute; i. 
</P>
<P>Ensuite, on applique un algoithme g&eacute;n&eacute;tique
(utilisant des notions comme la s&eacute;lection, le croisement, la
mutation etc...) pour obtenir (on l&rsquo;esp&egrave;re) une solution
proche de la solution optimale. 
</P>
<P>Q&nbsp;: Comment obtenir un emploi du temps optimal et pourquoi
obtient-on des r&eacute;sultats diff&eacute;rents chaque fois&nbsp;? 
</P>
<P>R&nbsp;: La g&eacute;n&eacute;ration de l&rsquo;emploi du temps
est un processus al&eacute;atoire&nbsp;; si les r&eacute;sultats ne
sont pas satisfaisants, veuillez red&eacute;marrer et r&eacute;essayer.
Vous pouvez aussi augmenter le nombre de chromosomes (population
number&nbsp;: quitter FET, modifier le fichier input/fet.ini et
relancer FET). Pour l&rsquo;instant, le nombre de chromosomes est
limit&eacute; &agrave; 8192 mais, si vous avez suffisamment de RAM,
vous pouvez l&rsquo;augmenter (8192 &eacute;gale environ 180 Mo).
Cette variable est stock&eacute;e dans le fichier
src/engine/genetictimetable_defs.h et s&rsquo;appelle
MAX_POPULATION_NUMBER. 
</P>
<P>Q&nbsp;: Je DETESTE l&rsquo;interface&nbsp;! 
</P>
<P>R&nbsp;: La structure et l&rsquo;organisation des donn&eacute;es
de FET ont beaucoup de potentiel&nbsp;; malheureusement, je n&rsquo;ai
pas eu le temps de concevoir l&rsquo;interface utilisateur
correspondante. J&rsquo;esp&egrave;re que, dans l&rsquo;avenir, moi
ou quelqu&rsquo;un d&rsquo;autre aura le temps d&rsquo;y rem&eacute;dier.
</P>
<P>Q&nbsp;: Quelle est l&rsquo;organisation des &eacute;tudiants que
FET peut prendre en compte&nbsp;? 
</P>
<P>R&nbsp;: FET a &eacute;t&eacute; con&ccedil;u pour pouvoir prendre
en compte n&rsquo;importe quelle structure scolaire&nbsp;: 
</P>
<P>sous-groupes ind&eacute;pendants (sans recouvrement) 
</P>
<P>groupes se recouvrant (plusieurs sous-groupes), promotions
(niveaux) se recouvrant (plusieurs groupes). 
</P>
<P>Q&nbsp;: Comment travaille-t-on avec des groupes d&rsquo;&eacute;tudiants
se recouvrant&nbsp;? 
</P>
<P>R&nbsp;: Si vous avez des groupes se recouvrant, vous devez
d&eacute;finir les plus petits sous-groupes ind&eacute;pendants, qui
ne se recouvrent pas avec un autre groupe. 
</P>
<P>Exemple&nbsp;: vous avez un groupe, mati&egrave;re sport (gar&ccedil;ons
et filles s&eacute;par&eacute;s) et une mati&egrave;re optionnelle,
sciences physiques, qu&rsquo;une partie seulement des &eacute;tudiants
a choisi de suivre (oui, FET peut g&eacute;rer des mati&egrave;res
optionnelles). Il faut alors d&eacute;finir les sous-groupes
suivants&nbsp;: gar&ccedil;ons qui veulent des sciences physiques,
gar&ccedil;ons qui ne veulent pas des sciences physiques, filles qui
veulent des sciences physiques, filles qui ne veulent pas des
sciences physiques. Ensuite, il suffit de d&eacute;finir&nbsp;: 
</P>
<P>groupe gar&ccedil;ons = sous-groupes gar&ccedil;ons qui veulent
des sciences physique + gar&ccedil;ons qui ne veulent pas des
sciences physiques 
</P>
<P>groupe filles = sous-groupes filles qui veulent des sciences
physiques, filles qui ne veulent pas des sciences physiques 
</P>
<P>groupe sciences physiques = sous-groupes gar&ccedil;ons qui
veulent des sciences physiques + filles qui veulent des sciences
physiques. 
</P>
<P>Vous pouvez alors ajouter des activit&eacute;s pour les groupes
ainsi d&eacute;finis&nbsp;: 
</P>
<P>Activit&eacute; 1&nbsp;: enseignant A, groupe filles, mati&egrave;re
sport&nbsp;; 
</P>
<P>Activit&eacute; 2&nbsp;: enseignant B, groupe gar&ccedil;ons,
mati&egrave;re sport&nbsp;; 
</P>
<P>Activit&eacute; 3&nbsp;: enseignant C, groupe sciences physiques,
mati&egrave;re sciences physiques. 
</P>
<P>Q&nbsp;: Peut-on ajouter plusieurs groupes d&rsquo;&eacute;tudiants
et plusieurs enseignants &agrave; une m&ecirc;me activit&eacute;&nbsp;?
</P>
<P>R&nbsp;: Oui, vous pouvez cr&eacute;er des activit&eacute;s
comportant plusieurs enseignants et plusieurs groupes d&rsquo;&eacute;tudiants
(promotions, groupes ou sous-groupes). 
</P>
<P>Q&nbsp;: Que repr&eacute;sente le poids des contraintes&nbsp;? 
</P>
<P>R&nbsp;: C&rsquo;est l&rsquo;importance des contraintes, les unes
par rapport aux autres. Pour l&rsquo;instant, essayez de n&rsquo;utiliser
que des poids entiers. Je n&rsquo;ai jamais eu &agrave; utiliser de
valeurs diff&eacute;rentes de 1, mais vous pourriez en avoir besoin. 
</P>
<P>Q&nbsp;: Comment puis-je augmenter la puissance de recherche&nbsp;?
</P>
<P>A&nbsp;: Il faut augmenter le nombre de chromosomes (population
number). 
</P>
<P>Q&nbsp;: Que signifie activit&eacute; bihebdomadaire&nbsp;? 
</P>
<P>R&nbsp;: C&rsquo;est une activit&eacute; qui a lieu toutes les
deux semaines (ce concept n&rsquo;est peu-&ecirc;tre pas commun, mais
je l&rsquo;ai impl&eacute;ment&eacute; d&egrave;s le d&eacute;but
parce que ma facult&eacute; en avait besoin). (NdT&nbsp;: ce concept
est tr&egrave;s utilis&eacute; dans les &eacute;tablissements
secondaires en France pour tenir compte de volumes horaires
non-entiers) 
</P>
<P>Q&nbsp;: Pourquoi les conflits sont-ils indiqu&eacute;s avec une
importance double&nbsp;? 
</P>
<P>R&nbsp;: Parce que ces conflits font r&eacute;f&eacute;rence &agrave;
des activit&eacute;s hebdomadaires. Pour les activit&eacute;s
bihebdomadaires, les conflits sont indiqu&eacute;s avec une
importance simple. 
</P>
<P>Q&nbsp;: Comment puis-je contribuer &agrave; FET&nbsp;? 
</P>
<P>R&nbsp;: Veuillez lire le fichier TODO. Vous pouvez aussi envoyer
vos commentaires/suggestions &agrave; l&rsquo;auteur. FET est un
logiciel libre et toute donation serait appr&eacute;ci&eacute;e.
Veuillez contacter l&rsquo;auteur &agrave; ce sujet. 
</P>
<P>Q&nbsp;: Quel est l&rsquo;algorithme de FET&nbsp;? 
</P>
<P>R&nbsp;: Un algorithme g&eacute;n&eacute;tique simple, appliqu&eacute;
sur un mod&egrave;le de donn&eacute;es simple. 
</P>
<P>Dans l&rsquo;avenir, j&rsquo;esp&egrave;re pouvoir mettre ici une
vraie description de l&rsquo;algorithme. En attendant, voici quelques
trucs n&eacute;cessaires pour comprendre le programme&nbsp;: 
</P>
<P>L&rsquo;algorithme g&eacute;n&eacute;tique et la repr&eacute;sentation
des donn&eacute;es qui sont derri&egrave;re le programme m&rsquo;ont
l&rsquo;air vraiment simple maintenant et je pense pouvoir
l&rsquo;expliquer au maximum en deux heures. Le moteur lui-m&ecirc;me
n&rsquo;est pas non plus tr&egrave;s compliqu&eacute; &agrave;
comprendre. Le cauchemar est dans l&rsquo;interface graphique, la
mod&eacute;lisation, la sauvegarde et le chargement des donn&eacute;es.
</P>
<P>L&rsquo;allocation du temps (heures) et de l&rsquo;espace (salles)
sont deux phases similaires. Vous pouvez lire mes articles pour
comprendre pourquoi il faut d&rsquo;abord allouer les heures et
ensuite les salles. 
</P>
<P>J&rsquo;utilise une liste QPtrList pour les enseignants, les
mati&egrave;res, les &eacute;tudiants (promotions, groupes,
sous-groupes), les activit&eacute;s et les contraintes. Avant de
commencer la simulation, ces informations sont copi&eacute;es dans
des tableaux pour acc&eacute;l&eacute;rer les calculs. La simulation
fonctionne alors en utilisant l&rsquo;index de ces nouveaux tableaux
pour chaque enseignant, mati&egrave;re et activit&eacute;. Les
emplois du temps sont repr&eacute;sent&eacute;s comme des matrices,
index&eacute;es par les enseignants (ou &eacute;tudiants ou salles)
et les jours et heures et contiennent des entiers, qui repr&eacute;sentent
les indices des activit&eacute;s. 
</P>
<P>J&rsquo;utilise des int16 quelquefois pour des raisons de
consommation m&eacute;moire. 
</P>
<P>Avec une population maximale de 8192, la classe Rules a une taille
d&rsquo;&agrave; peu pr&egrave;s 180 Mo (j&rsquo;esp&egrave;re ne pas
me tromper). 
</P>
<P>Q&nbsp;: Pouvez-vous d&eacute;tailler l&rsquo;utilisation des
poids pour les contraintes&nbsp;? 
</P>
<P>R&nbsp;: Le poids d&rsquo;une contrainte peut &ecirc;tre un nombre
r&eacute;el (double). MAIS&nbsp;: j&rsquo;ai pr&eacute;f&eacute;r&eacute;
(pour des questions de vitesse) que la valeur de retour d&rsquo;une
contrainte soit un entier, c&rsquo;est pourquoi c&rsquo;est une
valeur r&eacute;elle arrondie &agrave; l&rsquo;entier le plus proche.
Pour l&rsquo;instant, essayez de travailler avec des poids entiers. 
</P>
<P>Q&nbsp;: Pouvez-vous expliquer pourquoi FET travaille en deux
phases, d&rsquo;abord les heures, puis les salles&nbsp;? 
</P>
<P>A&nbsp;: Pour des questions de vitesse. Mais, avec l&rsquo;allocation
en deux phases, la premi&egrave;re phase peut aboutir &agrave; des
solutions qui ne sont pas compatibles avec la deuxi&egrave;me phase
(par exemple,avec les donn&eacute;es de l&rsquo;&eacute;chantillon
12, de Marek Jaszuk, on n&rsquo;atteint pas de solution optimale pour
la deuxi&egrave;me phase, alors qu&rsquo;il existe une telle
solution, trouv&eacute;e manuellement). 
</P>
<P>Il y a deux solutions &agrave; ce probl&egrave;me&nbsp;: 
</P>
<P>1 - FET pourrait travailler en une seule phase (mais le temps de
calcul serait beaucoup plus long) ou 
</P>
<P>2 - il faudrait ajouter des contraintes temporelles pour que la
solution de la premi&egrave;re phase respecte toutes les contraintes
spatiales (tr&egrave;s compliqu&eacute;, les contraintes pouvant &ecirc;tre
obligatoires ou non, et le temps d&rsquo;ex&eacute;cution est tr&egrave;s
long). 
</P>
<P>C&rsquo;est un probl&egrave;me pour lequel on recherche une
solution. 
</P>
<P>Q&nbsp;: Comment fonctionne ConstraintActivitiesSameTime (m&ecirc;me
heure pour plusieurs activit&eacute;s)&nbsp;? 
</P>
<P>R&nbsp;: Pour les contraintes obligatoires, la solution envisag&eacute;e
est mise en conformit&eacute; avec la contrainte avant &eacute;valuation,
de telle fa&ccedil;on que toutes les solutions envisag&eacute;es
respectent cette contrainte et qu&rsquo;il n&rsquo;y ait pas de
conflit signal&eacute;. Cette solution est la plus rapide, comme l&rsquo;a
montr&eacute; le fichier de donn&eacute;es de Ian Fantom. Pour les
contraintes non obligatoires, la m&eacute;thode est le signalement de
conflits (plus lent, moins bon que la m&eacute;thode ci-dessus). 
</P>
<P>Q&nbsp;: Comment fonctionne ConstraintActivityPreferredTime (heure
souhait&eacute;s pour une activit&eacute;)&nbsp;? 
</P>
<P>R&nbsp;: Pour les contraintes obligatoires, la solution envisag&eacute;e
est mise en conformit&eacute; avec la contrainte avant &eacute;valuation,
de telle fa&ccedil;on que toutes les solutions envisag&eacute;es
respectent cette contrainte et qu&rsquo;il n&rsquo;y ait pas de
conflit signal&eacute;. Cette m&eacute;thode est plus rapide (prouv&eacute;
par l&rsquo;exp&eacute;rience, pas en th&eacute;orie). 
</P>
<P>Pour les contraintes non obligatoires, la m&eacute;thode est le
signalement de conflits. La fonction renvoie un facteur de conflit
qui augmente avec la distance par rapport &agrave; l&rsquo;heure
souhait&eacute;e. Ceci peut g&eacute;n&eacute;rer des solutions moins
bonnes, si on est int&eacute;ress&eacute; uniquement par un
positionnement exact. Dans ce cas, il est pr&eacute;f&eacute;rable
d&rsquo;utiliser ConstraintActivityPreferredTimes (plusieurs heures
possibles), avec une seule heure souhait&eacute;e. 
</P>
<P>Exemple&nbsp;: 5 jours dans la semaine, 5 activit&eacute;s,
exclusives, une par jour. 
</P>
<P>Activit&eacute; 1&nbsp;: de pr&eacute;f&eacute;rence le lundi 
</P>
<P>Activit&eacute; 2&nbsp;: de pr&eacute;f&eacute;rence le lundi 
</P>
<P>Activit&eacute; 3&nbsp;: de pr&eacute;f&eacute;rence le mardi 
</P>
<P>Activit&eacute; 4&nbsp;: de pr&eacute;f&eacute;rence le jeudi 
</P>
<P>Activit&eacute; 5&nbsp;: jour indiff&eacute;rent 
</P>
<P>La meilleure solution, avec ConstraintActvityPreferredTime (sans
s), contiendra 2 conflits, et une solution pourra &ecirc;tre&nbsp;: 
</P>
<P>Activit&eacute; 1 le lundi 
</P>
<P>Activit&eacute; 2 le mardi (conflit) 
</P>
<P>Activit&eacute; 3 le mercredi (conflit) 
</P>
<P>Activit&eacute; 4 le jeudi 
</P>
<P>Activit&eacute; 5 le vendredi 
</P>
<P>Si vous utilisez ConstraintActvityPreferredTimes (avec s), vous
n&rsquo;aurez qu&rsquo;un seul conflit&nbsp;: 
</P>
<P>Activit&eacute; 1 le lundi 
</P>
<P>Activit&eacute; 2 le mercredi (conflit) 
</P>
<P>Activit&eacute; 3 le mardi 
</P>
<P>Activit&eacute; 4 le jeudi 
</P>
<P>Activit&eacute; 5 le vendredi 
</P>
<P>Q&nbsp;: Quels sont les avantages de FET par rapport &agrave;
d&rsquo;autres applications&nbsp;? 
</P>
<P>R&nbsp;: - C&rsquo;est un Logiciel Libre&nbsp;; 
</P>
<P>Il supporte les activit&eacute;s hebdomadaires et bi-hebdomadaires
(mon universit&eacute; de Craiova, Roumanie, avait besoin de cette
fonctionnalit&eacute;)&nbsp;; 
</P>
<P>Sous-groupes ind&eacute;pendants, groupes ind&eacute;pendants ou
non, promotions ind&eacute;pendantes ou non (suffisamment flexible
pour permettre n&rsquo;importe quel type d&rsquo;organisation des
groupes d&rsquo;&eacute;tudiants). FET peu m&ecirc;me &ecirc;tre
utilis&eacute; pour g&eacute;rer chaque &eacute;tudiants
individuellement si vous en avez vraiment besoin&nbsp;; 
</P>
<P>Possibilit&eacute; de g&eacute;rer des activit&eacute;s
optionnelles&nbsp;; 
</P>
<P>Beaucoup de types de contraintes, avec la possibilit&eacute; d&rsquo;en
ajouter beaucoup d&rsquo;autres (merci d&rsquo;en sugg&eacute;rer&nbsp;!).
</P>
<P>Q&nbsp;: Quels sont les inconv&eacute;nients de FET par rapport &agrave;
d&rsquo;autres applications&nbsp;? 
</P>
<P>R&nbsp;: Pas tr&egrave;s convivial (pas d&rsquo;aide, interface
graphique tr&egrave;s primitive)&nbsp;; Potentiellement bugg&eacute;.
Je n&rsquo;ai pas assez de fichiers d&rsquo;exemples pour tester FET
(et je d&eacute;teste faire des tests&nbsp;:-) 
</P>
<P>Q&nbsp;: Est-ce que FET compile dans d&rsquo;autres environnement
que GNU/Linux&nbsp;? 
</P>
<P>R&nbsp;: FET peut &ecirc;tre compil&eacute; dans des
environnements similaires &agrave; GNU/Linux. Je fournirai de l&rsquo;aide
pour compiler ce logiciel dans tout environnement libre. Je ne
fournirait PAS d&rsquo;aide pour compiler ce logiciel dans une
environnement non-libre (au sens de la GNU/GPL). 
</P>
<P>Q&nbsp;: Est-ce que FET pr&eacute;tend &ecirc;tre le meilleur
logiciel d&rsquo;emploi du temps au monde, comme toutes les autres
applications de planification&nbsp;? 
</P>
<P>R&nbsp;: Je ne peux pas pr&eacute;tendre &ccedil;a, parce que je
n&rsquo;ai pas pu comparer FET avec d&rsquo;autres applications (si
vous pouviez m&rsquo;aider, ce serait g&eacute;nial). Tout ce que je
peux dire aujourd&rsquo;hui, c&rsquo;est que je n&rsquo;ai vu aucune
application qui g&egrave;re autant de contraintes et qui pr&eacute;sente
la m&ecirc;me flexibilit&eacute; que FET, sans parler du fait qu&rsquo;il
s&rsquo;agit de logiciel libre. 
</P>
<P>FET est-il le premier logiciel libre de gestion d&rsquo;emplois du
temps (GNU/GPL)&nbsp;? Hmmm... le premier a &eacute;t&eacute; Tablix,
comme je l&rsquo;ai d&eacute;couvert apr&egrave;s avoir termin&eacute;
FET. Mon opinion personnelle est que FET est meilleur. Bien s&ucirc;r,
je peux me tromper. 
</P>
<P>Q&nbsp;: Quelle est la diff&eacute;rence entre l&rsquo;initialisation
&laquo;&nbsp;non allou&eacute;e&nbsp;&raquo; et l&rsquo;initialisation
al&eacute;atoire&nbsp;? Quelle est la meilleure&nbsp;? 
</P>
<P>R&nbsp;: C&rsquo;est la m&eacute;thode utilis&eacute;e pour
initialiser la population de solutions possibles. Il semblerait
(r&eacute;sultats empiriques) que l&rsquo;initialisation
&laquo;&nbsp;non-allou&eacute;e&nbsp;&raquo; soit meilleure. 
</P>
<P>Q&nbsp;: Qu&rsquo;est ce que ConstraintMinNDaysBetweenActivities&nbsp;?
</P>
<P>R&nbsp;: Cette contrainte s&rsquo;applique &agrave; un ensemble
d&rsquo;activit&eacute;s et comporte une constante N. Les activit&eacute;s
devront &ecirc;tre distantes deux &agrave; deux d&rsquo;au moins N
jours. Pour N=1, cette contrainte signifie que les activit&eacute;s
ne pourront pas &ecirc;tre planifi&eacute;es le m&ecirc;me jour. Pour
N=2, les activit&eacute;s devront &ecirc;tre s&eacute;par&eacute;es
par au moins une journ&eacute;e. 
</P>
<P>Exemple 1&nbsp;: 3 activit&eacute;s et N=2. Les activit&eacute;s
peuvent &ecirc;tre plac&eacute;es le lundi, le mercredi et le
vendredi (5 jours dans la semaine). 
</P>
<P>Exemple 2&nbsp;: 2 activit&eacute;s et N=3. Les activit&eacute;s
peuvent &ecirc;tre plac&eacute;es le lundi et le jeudi, le lundi et
le vendredi ou le mardi et le vendredi (5 jours dans la semaine). 
</P>
<P>Q&nbsp;: Est-il facile d&rsquo;ajouter de nouveaux types de
contraintes dans FET&nbsp;? 
</P>
<P>R&nbsp;: C&rsquo;est tr&egrave;s facile. Je peux impl&eacute;menter
une nouvelle contrainte en quelques heures. Vous trouverez une
description de la proc&eacute;dure dans le r&eacute;pertoire
doc/how-to-implement-new-constraints 
</P>
<P>Q&nbsp;: Qu&rsquo;est-ce que ConstraintStudentsEarly. 
</P>
<P>R&nbsp;: C&rsquo;est une contrainte qui impose comme condition de
faire d&eacute;buter les cours des &eacute;tudiants aussi t&ocirc;t
que possible. Vous devez faire attention avec cette contrainte&nbsp;:
si un groupe d&rsquo;&eacute;tudiant commence plus tard que la
premi&egrave;re heure de la journ&eacute;e, vous aurez un conflit. 
</P>
<P>Q&nbsp;: FET n&rsquo;arrive pas &agrave; r&eacute;soudre mon
emploi du temps&nbsp;? 
</P>
<P>R&nbsp;: Essayez d&rsquo;utiliser une population plus grande.
Essayez aussi de refaire d&rsquo;autres simulations. Si cela ne
suffit pas, assouplissez les contraintes sur l&rsquo;emploi du temps,
par exemple en supprimant des contraintes obligatoires ou en les
rendant non-obligatoires.</P>
<P><BR><BR>
</P>
</BODY>
</HTML>